[
  {
    "image": "https://play-lh.googleusercontent.com/bYtqbOcTYOlgc6gqZ2rwb8lptHuwlNE75zYJu6Bn076-hTmvd96HH-6v7S0YUAAJXoJN=w480-h960-rw",
    "title": "WhatsApp Messenger",
    "companyName": "WhatsApp LLC",
    "id": 1,
    "description": "WhatsApp Messenger is one of the most popular communication platforms in the world, designed to help you stay connected with friends, family, and colleagues across any distance. With end-to-end encryption, every message, call, and media file remains completely private, ensuring your personal conversations stay secure. WhatsApp lets users send text messages, share photos, videos, documents, and voice messages instantly — all for free. Group chats make it easy to stay in touch with communities, while WhatsApp Web and Desktop sync seamlessly with your mobile account for multitasking convenience. The app also supports voice and video calls in HD, letting you connect face-to-face regardless of where you are. WhatsApp has continued evolving with features like disappearing messages, status updates, and community hubs that organize conversations better. Its clean interface, reliability, and strong privacy foundation have made it the go-to app for billions. Whether for casual chats, professional coordination, or staying close to loved ones abroad, WhatsApp is designed to make communication fast, simple, and meaningful. With minimal data usage and global accessibility, it bridges people in every corner of the world. Over time, WhatsApp has grown beyond messaging into a full ecosystem of secure communication — connecting people effortlessly through technology and trust.",
    "size": 85,
    "reviews": 350000000,
    "ratingAvg": 4.7,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/6am0i3walYwNLc08QOOhRJttQENNGkhlKajXSERf3JnPVRQczIyxw2w3DxeMRTOSdsY=s96-rw",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 2,
    "description": "YouTube is the world’s largest video-sharing platform, empowering billions of people to explore, create, and share content every day. From music and entertainment to education and news, YouTube brings the entire world of video into one place. The app’s intelligent recommendation system learns from your viewing habits to curate a personalized experience, showing videos you’ll love before you even search. Users can subscribe to their favorite creators, comment, share opinions, and join global conversations in real time. YouTube Premium offers an ad-free experience with background play and offline downloads, letting you enjoy uninterrupted entertainment anywhere. Content creators use YouTube to express creativity and build communities through vlogs, tutorials, live streams, and shorts. The platform supports high-definition playback and even 4K streaming for immersive visual quality. For learners, YouTube is a massive free university — offering lessons, lectures, and insights across every topic imaginable. Whether you’re watching music videos, DIY hacks, documentaries, or trending memes, YouTube connects creators and viewers in an endless loop of discovery and inspiration. Constant innovation, accessibility, and diversity make YouTube more than just an app — it’s the heartbeat of the modern internet.",
    "size": 120,
    "reviews": 450000000,
    "ratingAvg": 4.6,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/VRMWkE5p3CkWhJs6nv-9ZsLAs1QOg5ob1_3qg-rckwYW7yp1fMrYZqnEFpk0IoVP4LM=s96-rw",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Instagram lets you share your life’s moments through photos, videos, stories, and reels. Discover content that inspires you, from fashion and travel to music and art. Connect with friends, influencers, and brands that match your interests. Go live, chat privately, or engage through reels and stories. Instagram brings creativity and community together, giving you endless tools to express yourself visually. Stay up to date with trends and explore what the world is sharing today, all within one app. Instagram lets you share your life’s moments through photos, videos, stories, and reels. Discover content that inspires you, from fashion and travel to music and art. Connect with friends, influencers, and brands that match your interests. Go live, chat privately, or engage through reels and stories. Instagram brings creativity and community together, giving you endless tools to express yourself visually. Stay up to date with trends and explore what the world is sharing today, all within one app.",
    "size": 100,
    "reviews": 250000000,
    "ratingAvg": 4.5,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/sUXm7uP_c8ysJqwOkbmIpBnDee_6lJJCPODRP4DOCuFWp9Gq-_X_oqY9NTJ2OIEGtQ=w480-h960-rw",
    "title": "TikTok",
    "companyName": "TikTok Pte. Ltd.",
    "id": 4,
    "description": "TikTok is a creative short-form video platform where millions of people come together to create, discover, and share entertainment. Enjoy endless scrolling with videos made just for you, from fun dances to educational tips. Create your own content using built-in editing tools, sound effects, and filters. Join challenges, duet with friends, and explore global trends. TikTok is a place where authenticity meets creativity — watch, laugh, and inspire the world one short video at a time. TikTok is a creative short-form video platform where millions of people come together to create, discover, and share entertainment. Enjoy endless scrolling with videos made just for you, from fun dances to educational tips. Create your own content using built-in editing tools, sound effects, and filters. Join challenges, duet with friends, and explore global trends. TikTok is a place where authenticity meets creativity — watch, laugh, and inspire the world one short video at a time.",
    "size": 95,
    "reviews": 220000000,
    "ratingAvg": 4.6,
    "downloads": 3000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/TBRwjS_qfJCSj1m7zZB93FnpJM5fSpMA_wUlFDLxWAb45T9RmwBvQd5cWR5viJJOhkI=w480-h960-rw",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 5,
    "description": "Netflix brings the world’s best entertainment straight to your screen. Stream movies, TV series, documentaries, and exclusive Netflix Originals anytime, anywhere. Enjoy personalized recommendations tailored to your taste. Create multiple profiles for your household and download episodes for offline watching. With high-quality streaming up to 4K HDR, Netflix gives you cinematic experience on your phone or TV. From thrillers to comedies, discover stories that move the world, only on Netflix. Netflix brings the world’s best entertainment straight to your screen. Stream movies, TV series, documentaries, and exclusive Netflix Originals anytime, anywhere. Enjoy personalized recommendations tailored to your taste. Create multiple profiles for your household and download episodes for offline watching. With high-quality streaming up to 4K HDR, Netflix gives you cinematic experience on your phone or TV. From thrillers to comedies, discover stories that move the world, only on Netflix.",
    "size": 150,
    "reviews": 310000000,
    "ratingAvg": 4.5,
    "downloads": 2000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/KCMTYuiTrKom4Vyf0G4foetVOwhKWzNbHWumV73IXexAIy5TTgZipL52WTt8ICL-oIo=w480-h960-rw",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 6,
    "description": "Facebook helps you connect with friends, family, and communities around the world. Share photos, updates, and videos instantly. Join groups, follow pages, and discover local events. Engage with content you love and express yourself through posts, comments, and reactions. With Facebook Marketplace, you can buy and sell items in your area easily. Facebook’s mission is to give people the power to build community and bring the world closer together. Facebook helps you connect with friends, family, and communities around the world. Share photos, updates, and videos instantly. Join groups, follow pages, and discover local events. Engage with content you love and express yourself through posts, comments, and reactions. With Facebook Marketplace, you can buy and sell items in your area easily. Facebook’s mission is to give people the power to build community and bring the world closer together.",
    "size": 110,
    "reviews": 420000000,
    "ratingAvg": 4.4,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/KxeSAjPTKliCErbivNiXrd6cTwfbqUJcbSRPe_IBVK_YmwckfMRS1VIHz-5cgT09yMo=w480-h960-rw",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 7,
    "description": "Snapchat is the fastest way to share a moment. Send photos and videos that disappear after being viewed. Express yourself with filters, Bitmoji, and AR lenses. Stay in touch through chat and discover trending stories from around the world. With Snap Map, you can see where your friends are hanging out and explore what’s happening nearby. Snapchat’s unique design keeps your conversations fun, creative, and real. Snapchat is the fastest way to share a moment. Send photos and videos that disappear after being viewed. Express yourself with filters, Bitmoji, and AR lenses. Stay in touch through chat and discover trending stories from around the world. With Snap Map, you can see where your friends are hanging out and explore what’s happening nearby. Snapchat’s unique design keeps your conversations fun, creative, and real.",
    "size": 95,
    "reviews": 200000000,
    "ratingAvg": 4.3,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/ZU9cSsyIJZo6Oy7HTHiEPwZg0m2Crep-d5ZrfajqtsH-qgUXSqKpNA2FpPDTn-7qA5Q=w480-h960-rw",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 8,
    "description": "Telegram is a fast and secure messaging app focused on privacy and speed. Chat seamlessly with friends or large groups with up to 200,000 members. Share media and files of any type, up to 2 GB each. Telegram offers cloud storage, meaning your messages are synced across all your devices. Enjoy secret chats with self-destruct timers, voice calls, and bots for productivity. Telegram is free, open-source, and ad-free — making it the most trusted messaging alternative globally. Telegram is a fast and secure messaging app focused on privacy and speed. Chat seamlessly with friends or large groups with up to 200,000 members. Share media and files of any type, up to 2 GB each. Telegram offers cloud storage, meaning your messages are synced across all your devices. Enjoy secret chats with self-destruct timers, voice calls, and bots for productivity. Telegram is free, open-source, and ad-free — making it the most trusted messaging alternative globally.",
    "size": 70,
    "reviews": 180000000,
    "ratingAvg": 4.8,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/Kf8WTct65hFJxBUDm5E-EpYsiDoLQiGGbnuyP6HBNax43YShXti9THPon1YKB6zPYpA=w480-h960-rw",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 9,
    "description": "Google Maps helps you navigate the world effortlessly. Get real-time GPS navigation, traffic updates, and local business information. Explore nearby restaurants, gas stations, and attractions. Save your favorite places and share them with friends. Use Street View to explore landmarks virtually. Whether walking, driving, or taking public transport, Google Maps ensures you reach your destination safely and quickly. It’s your go-to app for travel and exploration. Google Maps helps you navigate the world effortlessly. Get real-time GPS navigation, traffic updates, and local business information. Explore nearby restaurants, gas stations, and attractions. Save your favorite places and share them with friends. Use Street View to explore landmarks virtually. Whether walking, driving, or taking public transport, Google Maps ensures you reach your destination safely and quickly. It’s your go-to app for travel and exploration.",
    "size": 95,
    "reviews": 280000000,
    "ratingAvg": 4.6,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/7ynvVIRdhJNAngCg_GI7i8TtH8BqkJYmffeUHsG-mJOdzt1XLvGmbsKuc5Q1SInBjDKN=w480-h960-rw",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 10,
    "description": "Spotify lets you listen to millions of songs, podcasts, and playlists from artists all around the world. Create and share your playlists or explore curated mixes made for every mood. Enjoy personalized recommendations based on your listening habits. Upgrade to Spotify Premium to download songs for offline use and enjoy ad-free music with high-quality sound. Whether you’re studying, working out, or relaxing, Spotify has the perfect soundtrack for you. Spotify lets you listen to millions of songs, podcasts, and playlists from artists all around the world. Create and share your playlists or explore curated mixes made for every mood. Enjoy personalized recommendations based on your listening habits. Upgrade to Spotify Premium to download songs for offline use and enjoy ad-free music with high-quality sound. Whether you’re studying, working out, or relaxing, Spotify has the perfect soundtrack for you.",
    "size": 90,
    "reviews": 310000000,
    "ratingAvg": 4.7,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/yZsmiNjmji3ZoOuLthoVvptLB9cZ0vCmitcky4OUXNcEFV3IEQkrBD2uu5kuWRF5_ERA=w480-h960-rw",
    "title": "Zoom",
    "companyName": "Zoom Video Communications, Inc.",
    "id": 11,
    "description": "Zoom makes video meetings easy and accessible from anywhere. Host or join HD video conferences, webinars, or online classes seamlessly. Collaborate using screen sharing, chat, and breakout rooms. With features like virtual backgrounds and recording, Zoom is ideal for both business and personal use. Stay connected with your team, friends, or clients — whether you’re at home or on the go. Zoom redefines online communication. Zoom makes video meetings easy and accessible from anywhere. Host or join HD video conferences, webinars, or online classes seamlessly. Collaborate using screen sharing, chat, and breakout rooms. With features like virtual backgrounds and recording, Zoom is ideal for both business and personal use. Stay connected with your team, friends, or clients — whether you’re at home or on the go. Zoom redefines online communication.",
    "size": 80,
    "reviews": 170000000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/1Ns1T_qN0pEXMvZeZ5lQNAR8z4blP7ce2J2Nn5doXvt2T1g_W7VMORdWHaApkOooupI=s96-rw",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "id": 12,
    "description": "Amazon Shopping lets you buy anything from anywhere. Browse millions of products, compare prices, and read customer reviews. Enjoy secure payments and fast delivery. Get personalized recommendations based on your browsing history. Track your orders, manage returns, and access exclusive Prime deals. Whether it's electronics, fashion, or groceries — Amazon brings the world’s largest marketplace to your pocket. Amazon Shopping lets you buy anything from anywhere. Browse millions of products, compare prices, and read customer reviews. Enjoy secure payments and fast delivery. Get personalized recommendations based on your browsing history. Track your orders, manage returns, and access exclusive Prime deals. Whether it's electronics, fashion, or groceries — Amazon brings the world’s largest marketplace to your pocket.",
    "size": 100,
    "reviews": 240000000,
    "ratingAvg": 4.6,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/kMofEFLjobZy_bCuaiDogzBcUT-dz3BBbOrIEjJ-hqOabjK8ieuevGe6wlTD15QzOqw=w480-h960-rw",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "id": 13,
    "description": "LinkedIn is the world’s largest professional network where you can connect with professionals, build your brand, and advance your career. Share updates, publish articles, and engage with content relevant to your industry. Discover job opportunities and connect with recruiters. With LinkedIn Learning, you can acquire new skills to boost your career. LinkedIn offers a trusted platform to build meaningful professional relationships and grow your career. LinkedIn is the world’s largest professional network where you can connect with professionals, build your brand, and advance your career. Share updates, publish articles, and engage with content relevant to your industry. Discover job opportunities and connect with recruiters. With LinkedIn Learning, you can acquire new skills to boost your career. LinkedIn offers a trusted platform to build meaningful professional relationships and grow your career.",
    "size": 95,
    "reviews": 150000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/A-Rnrh0J7iKmABskTonqFAANRLGTGUg_nuE4PEMYwJavL3nPt5uWsU2WO_DSgV_mOOM=w480-h960-rw",
    "title": "Twitter",
    "companyName": "Twitter, Inc.",
    "id": 14,
    "description": "Twitter is a microblogging platform that lets you share short updates, photos, and videos with the world. Follow people, join conversations, and explore trending hashtags. Engage with tweets through likes, retweets, and replies. Discover news instantly and participate in global discussions. Twitter is your go-to app for staying informed and connected to the latest events. Twitter is a microblogging platform that lets you share short updates, photos, and videos with the world. Follow people, join conversations, and explore trending hashtags. Engage with tweets through likes, retweets, and replies. Discover news instantly and participate in global discussions. Twitter is your go-to app for staying informed and connected to the latest events.",
    "size": 85,
    "reviews": 210000000,
    "ratingAvg": 4.3,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/6CFQQ0b9r5fzF1v6f0gIirWsOGL7sGWkJifuUQxxhbCMcBx5aSG_cNXpjDKDn5c1jwjq=w480-h960-rw",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "id": 15,
    "description": "Pinterest is a visual discovery engine that helps you find ideas for every aspect of your life. Explore pins for fashion, home decor, recipes, travel, and more. Create boards to organize your favorite ideas. Discover inspiration from around the world and turn your ideas into reality. Pinterest connects millions of people through creativity and inspiration. Pinterest is a visual discovery engine that helps you find ideas for every aspect of your life. Explore pins for fashion, home decor, recipes, travel, and more. Create boards to organize your favorite ideas. Discover inspiration from around the world and turn your ideas into reality. Pinterest connects millions of people through creativity and inspiration.",
    "size": 90,
    "reviews": 190000000,
    "ratingAvg": 4.6,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/n109V9dur2NFwV7Fbr8lwlU-isXRR0K7Q-pvp1LCyRwTVP2DfJaR-dklmXzK0MhQuz9E=w480-h960-rw",
    "title": "Uber",
    "companyName": "Uber Technologies, Inc.",
    "id": 16,
    "description": "Uber is the easiest way to get around. Request a ride with a tap, track your driver, and pay seamlessly through the app. Choose from a variety of ride types to fit your needs. Uber offers reliable and safe transportation in cities around the world. You can also explore Uber Eats for food delivery from your favorite restaurants. Uber keeps you moving wherever you go. Uber is the easiest way to get around. Request a ride with a tap, track your driver, and pay seamlessly through the app. Choose from a variety of ride types to fit your needs. Uber offers reliable and safe transportation in cities around the world. You can also explore Uber Eats for food delivery from your favorite restaurants. Uber keeps you moving wherever you go.",
    "size": 95,
    "reviews": 170000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/5ZOQbuxacVOWK6AM4Env-adyEWRUCJt0VrUl9bWKW4Z4qLSjJUBuMP8-dALMy9oWu530=w480-h960-rw",
    "title": "Airbnb",
    "companyName": "Airbnb, Inc.",
    "id": 17,
    "description": "Airbnb helps you find unique places to stay and things to do anywhere in the world. Browse millions of listings, from apartments to villas. Book experiences hosted by locals. Whether traveling for leisure or business, Airbnb offers a personalized experience. Discover hidden gems and make memories with Airbnb. Airbnb helps you find unique places to stay and things to do anywhere in the world. Browse millions of listings, from apartments to villas. Book experiences hosted by locals. Whether traveling for leisure or business, Airbnb offers a personalized experience. Discover hidden gems and make memories with Airbnb.",
    "size": 85,
    "reviews": 160000000,
    "ratingAvg": 4.7,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/0oO5sAneb9lJP6l8c6DH4aj6f85qNpplQVHmPmbbBxAukDnlO7DarDW0b-kEIHa8SQ=s96-rw",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 18,
    "description": "Discord is a voice, video, and text communication platform for communities. Join servers, chat with friends, and participate in discussions. Share images, videos, and links in real time. Whether gaming, learning, or working remotely, Discord provides the tools to connect and collaborate seamlessly. Discord is where communities come to life. Discord is a voice, video, and text communication platform for communities. Join servers, chat with friends, and participate in discussions. Share images, videos, and links in real time. Whether gaming, learning, or working remotely, Discord provides the tools to connect and collaborate seamlessly. Discord is where communities come to life.",
    "size": 80,
    "reviews": 140000000,
    "ratingAvg": 4.8,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/jKU64njy8urP89V1O63eJxMtvWjDGETPlHVIhDv9WZAYzsSxRWyWZkUlBJZj_HbkHA=w480-h960-rw",
    "title": "Microsoft Teams",
    "companyName": "Microsoft Corporation",
    "id": 19,
    "description": "Microsoft Teams is a collaboration app that helps teams stay organized and connected. Host meetings, chat, and share files all in one place. Integrate with Microsoft 365 tools to streamline workflow. Teams keeps remote work efficient and productive with chat channels, file sharing, and video conferencing. It’s the ultimate workspace for teamwork. Microsoft Teams is a collaboration app that helps teams stay organized and connected. Host meetings, chat, and share files all in one place. Integrate with Microsoft 365 tools to streamline workflow. Teams keeps remote work efficient and productive with chat channels, file sharing, and video conferencing. It’s the ultimate workspace for teamwork.",
    "size": 120,
    "reviews": 130000000,
    "ratingAvg": 4.4,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/tw_coGKgk1K_zO-Ypf9zBKV1s-KT3dYN1MIUxIqtnbfmON5x_YmuoAr31gE4oSfJHNtA-aStTd-qe9R8S6NVyA=w480-h960-rw",
    "title": "Duolingo",
    "companyName": "Duolingo, Inc.",
    "id": 20,
    "description": "Duolingo is a language learning app that makes learning fun and easy. Learn new languages through bite-sized lessons, quizzes, and games. Track your progress, earn rewards, and compete with friends. Duolingo covers dozens of languages for learners of all levels. Whether you want to learn for travel, work, or personal enrichment, Duolingo helps make language learning engaging and effective. Duolingo is a language learning app that makes learning fun and easy. Learn new languages through bite-sized lessons, quizzes, and games. Track your progress, earn rewards, and compete with friends. Duolingo covers dozens of languages for learners of all levels. Whether you want to learn for travel, work, or personal enrichment, Duolingo helps make language learning engaging and effective.",
    "size": 85,
    "reviews": 150000000,
    "ratingAvg": 4.7,
    "downloads": 300000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 36000000 },
      { "name": "3 star", "count": 50000000 },
      { "name": "4 star", "count": 85000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/tUZNUbnNGw8I6uLg8Zy2ZWbmSFuT5kK0dYA8tdqNmldlozNS_jSjDw5j2nElRsoTzQ=w480-h960-rw",
    "title": "Canva",
    "companyName": "Canva Pty Ltd",
    "id": 21,
    "description": "Canva is a design platform that allows anyone to create professional-quality graphics, presentations, posters, and social media posts with ease. The app features thousands of free templates, fonts, and design elements to make your ideas stand out. You can easily drag and drop images, add text, and collaborate with others in real time. Canva is ideal for students, marketers, and businesses that want to design stunning visuals without needing advanced design skills. The app supports brand kits, logo creation, and video editing. Whether you’re designing for Instagram, a resume, or a marketing campaign, Canva makes it simple and fast. With premium, you unlock more templates, background remover, and cloud storage. Canva helps turn creativity into impact, empowering millions to communicate visually across the globe.",
    "size": 95,
    "reviews": 160000000,
    "ratingAvg": 4.8,
    "downloads": 350000000,
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 12000000 },
      { "name": "3 star", "count": 20000000 },
      { "name": "4 star", "count": 40000000 },
      { "name": "5 star", "count": 80000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/Rilq4obCk7XIl2Pjb8XT-Ydh_aI3hBNeFwro9fFXrIAuC-zPxCZ4feE4rx5fZ3jHNLw=w480-h960-rw",
    "title": "Snapseed",
    "companyName": "Google LLC",
    "id": 22,
    "description": "Snapseed is a professional photo editing app developed by Google that brings desktop-level editing tools to your mobile device. It offers powerful features like RAW photo editing, healing, brush adjustments, filters, and perspective correction. Whether you’re a beginner or an expert, Snapseed helps you enhance photos with precision. You can adjust brightness, contrast, saturation, and sharpness manually or use auto-tune for instant results. With 29+ editing tools, it’s perfect for photographers, influencers, and designers. The app maintains image quality while allowing deep edits. You can even apply selective adjustments or add stylish effects to make your photos stand out. Snapseed’s user-friendly interface makes complex editing simple. It’s a must-have tool for anyone passionate about photography and visual creativity.",
    "size": 55,
    "reviews": 90000000,
    "ratingAvg": 4.5,
    "downloads": 200000000,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 8000000 },
      { "name": "3 star", "count": 15000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 37000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/mwTU9-4NX-_QlATb6lILSinKI47wAtOM38GjPYRPQSsQOG2hVRY4h9OfEhDxpf8ADQ=w480-h960-rw",
    "title": "Shazam",
    "companyName": "Apple, Inc.",
    "id": 23,
    "description": "Shazam is a music identification app that helps you discover the name of any song playing around you within seconds. Just tap to Shazam, and the app instantly recognizes the song, artist, and album. It works even offline and stores your history for future reference. Shazam connects directly to streaming services like Apple Music, Spotify, and YouTube, so you can listen to full tracks instantly. Beyond music recognition, Shazam provides lyrics, music videos, and artist recommendations. The app’s simple interface and lightning-fast speed make it a favorite for music lovers worldwide. Shazam helps you explore new artists, follow trends, and keep your playlist fresh. It’s not just a tool — it’s a gateway to discovering and enjoying more music effortlessly.",
    "size": 35,
    "reviews": 70000000,
    "ratingAvg": 4.8,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 37000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/Tt-6ZaQDUAjfSNSeLz4XyYkPsEQfVVp0lBtwrnuyqubhCna0LKu5OZxKgegBJIrEhz8=s96-rw",
    "title": "Trello",
    "companyName": "Atlassian",
    "id": 24,
    "description": "Trello is a productivity and project management app that helps teams organize tasks visually. Using boards, lists, and cards, Trello lets you track work progress and collaborate with teammates in real time. You can assign tasks, set deadlines, and attach files easily. Trello is widely used for team projects, personal goals, and business workflows. It integrates with apps like Slack, Google Drive, and Jira to streamline your productivity. The app’s clean interface and drag-and-drop design make it intuitive for everyone. Whether managing a startup, school project, or household to-do list, Trello helps keep everything organized. With premium features, users can automate tasks, create advanced dashboards, and manage unlimited boards efficiently.",
    "size": 60,
    "reviews": 50000000,
    "ratingAvg": 4.7,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 16000000 },
      { "name": "5 star", "count": 20000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/TpK0AcjPn5-XDKgSZ5jAob1H7MsQuJILOMR4M4QYkTt5CBPgTJVr7mysrKM6Ia8SrX8=w480-h960-rw",
    "title": "Khan Academy",
    "companyName": "Khan Academy, Inc.",
    "id": 25,
    "description": "Khan Academy is a free educational app offering thousands of lessons across subjects like math, science, computer programming, history, and more. It’s designed to make learning accessible to everyone, anywhere. Each topic includes interactive exercises, video lessons, and personalized progress tracking. The app supports learners from kindergarten to university level. Teachers and parents can also monitor progress and assign tasks. Khan Academy is trusted by millions of students worldwide for its high-quality, ad-free content. Its structured courses and self-paced learning help users master complex topics at their own speed. The platform is continually updated with new lessons and interactive quizzes to enhance learning outcomes. With Khan Academy, education truly becomes open for all.",
    "size": 80,
    "reviews": 60000000,
    "ratingAvg": 4.8,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 13000000 },
      { "name": "5 star", "count": 33000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/ZrNeuKthBirZN7rrXPN1JmUbaG8ICy3kZSHt-WgSnREsJzo2txzCzjIoChlevMIQEA=w480-h960-rw",
    "title": "Google Translate",
    "companyName": "Google LLC",
    "id": 26,
    "description": "Google Translate is a powerful language translation app that supports over 100 languages worldwide. It allows users to translate text, speech, handwriting, and even images instantly. Whether you’re traveling, learning a new language, or communicating with someone from another country, Google Translate makes it seamless. You can download languages for offline translation and use conversation mode for real-time bilingual chats. The app uses advanced AI to deliver accurate and natural translations. Its camera translation feature lets you translate signs, menus, or documents instantly. Google Translate bridges communication gaps, promoting understanding and global connection. It’s fast, simple, and a must-have app for travelers and learners alike.",
    "size": 45,
    "reviews": 180000000,
    "ratingAvg": 4.7,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 10000000 },
      { "name": "2 star", "count": 15000000 },
      { "name": "3 star", "count": 30000000 },
      { "name": "4 star", "count": 55000000 },
      { "name": "5 star", "count": 70000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/WUcazXmUT97aoXa1TmB72z1RrP4shaBA4Te9vH5fcCHIPCBVjj5F6fGEPgNq6HXmXw=s96-rw",
    "title": "Dropbox",
    "companyName": "Dropbox, Inc.",
    "id": 27,
    "description": "Dropbox is a cloud storage app that allows you to back up, access, and share your files from anywhere. It automatically syncs your documents, photos, and videos across devices, ensuring your data is always safe and available. With Dropbox, you can easily share large files with anyone, collaborate on documents, and manage projects efficiently. It integrates with tools like Microsoft Office and Google Workspace, making team collaboration seamless. The app also offers password protection, file recovery, and smart suggestions for productivity. Dropbox’s clean interface and secure cloud system make it ideal for both personal and professional use. Whether you’re working remotely or organizing your files, Dropbox keeps everything safe and in sync.",
    "size": 90,
    "reviews": 80000000,
    "ratingAvg": 4.4,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 10000000 },
      { "name": "3 star", "count": 20000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 27000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/t-juVwXA8lDAk8uQ2L6d6K83jpgQoqmK1icB_l9yvhIAQ2QT_1XbRwg5IpY08906qEw=w480-h960-rw",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "id": 28,
    "description": "Google Drive is a secure cloud storage platform that allows users to store, share, and access files from anywhere. It provides 15 GB of free storage and integrates seamlessly with other Google services like Docs, Sheets, and Gmail. With Drive, you can upload photos, videos, PDFs, and documents to the cloud and access them across all your devices. The app allows you to collaborate in real time with others, share folders with specific permissions, and back up important files automatically. Drive also supports offline access, advanced search, and file version history. Businesses and teams can use Google Workspace to expand storage and enhance productivity. Its strong security, two-step verification, and encryption make it a reliable choice for both personal and professional use. Whether you’re saving school projects, work documents, or personal photos, Google Drive keeps everything organized and safe.",
    "size": 110,
    "reviews": 250000000,
    "ratingAvg": 4.6,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 20000000 },
      { "name": "2 star", "count": 25000000 },
      { "name": "3 star", "count": 40000000 },
      { "name": "4 star", "count": 80000000 },
      { "name": "5 star", "count": 85000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/ZyWNGIfzUyoajtFcD7NhMksHEZh37f-MkHVGr5Yfefa-IX7yj9SMfI82Z7a2wpdKCA=w480-h960-rw",
    "title": "Google Photos",
    "companyName": "Google LLC",
    "id": 29,
    "description": "Google Photos is a smart photo and video management app that automatically backs up your media to the cloud. It offers powerful tools for searching, organizing, and sharing your memories. With AI-driven features, you can easily find photos by people, places, or objects. The app creates automatic albums, collages, and animations to relive your best moments. Google Photos also provides editing tools like filters, brightness adjustments, and cropping to enhance images before sharing. You can share albums privately or publicly and collaborate with friends or family. Its seamless integration with Google services allows easy access across all devices. With storage management tools and automatic cleanup, you never have to worry about running out of space. Whether you’re capturing daily memories or storing professional shots, Google Photos keeps your moments safe, organized, and beautifully displayed.",
    "size": 95,
    "reviews": 200000000,
    "ratingAvg": 4.5,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 15000000 },
      { "name": "2 star", "count": 20000000 },
      { "name": "3 star", "count": 30000000 },
      { "name": "4 star", "count": 60000000 },
      { "name": "5 star", "count": 75000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/b3MqZswO8F7j3lcdH01kxzaeHa7vUndy7ma_JwdM_j_Vpj8LKZcKt0HmpORQ7CKF2A=w480-h960-rw",
    "title": "Google News",
    "companyName": "Google LLC",
    "id": 30,
    "description": "Google News delivers the latest news from around the world, personalized to your interests. It curates stories from thousands of trusted publishers, providing a balanced and comprehensive view of current events. The app’s “For You” tab summarizes important headlines, while the “Full Coverage” feature gives multiple perspectives on the same topic. Users can follow their favorite publications, topics, and regions for tailored updates. Google News also supports offline reading, dark mode, and video content from major news outlets. Its AI algorithms ensure relevant, fact-checked, and high-quality news delivery. Whether you’re interested in politics, technology, sports, or entertainment, Google News keeps you informed with accuracy and depth. It’s designed for speed, simplicity, and reliability — giving users a smarter way to stay up-to-date in a rapidly changing world.",
    "size": 70,
    "reviews": 80000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 7000000 },
      { "name": "2 star", "count": 9000000 },
      { "name": "3 star", "count": 14000000 },
      { "name": "4 star", "count": 22000000 },
      { "name": "5 star", "count": 28000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/9bJoeaPbGTB8Tz_h4N-p-6ReRd8vSS-frZb2tmJulaGIoTKElKj3zpmcFJvnS96ANZP5=w480-h960-rw",
    "title": "Google Keep",
    "companyName": "Google LLC",
    "id": 31,
    "description": "Google Keep is a note-taking and organization app that helps you capture ideas quickly and stay productive. You can create notes, to-do lists, voice memos, and reminders in one simple interface. Notes sync automatically across devices through your Google account, ensuring you never lose important information. You can color-code notes, label them, and share with others for collaboration. Google Keep integrates with Google Calendar and Google Docs for better productivity. The app’s minimalist design makes it easy to focus on your ideas, while widgets allow quick access from your home screen. Whether you’re managing daily tasks, writing reminders, or brainstorming projects, Google Keep is a lightweight yet powerful tool to stay organized. It’s reliable, secure, and designed to help you capture thoughts wherever inspiration strikes.",
    "size": 30,
    "reviews": 65000000,
    "ratingAvg": 4.7,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 9000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 28000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/DHBlQKvUNbopIS-VjQb3fUKQ_QH0Em-Q66AwG6LwD1Sach3lUvEWDb6hh8xNvKGmctU=w480-h960-rw",
    "title": "Google Pay",
    "companyName": "Google LLC",
    "id": 32,
    "description": "Google Pay is a secure and convenient payment app that lets you pay, send money, and manage your finances from one place. It supports contactless payments in stores, online purchases, and peer-to-peer money transfers. Google Pay works with most major banks and supports debit and credit cards. Users can also store loyalty cards, tickets, and gift cards digitally. The app’s advanced security features, like tokenization and fingerprint authentication, protect your transactions and personal data. Google Pay provides smart insights into your spending and helps track bills and offers. With its clean interface and fast processing, payments become effortless. Whether you’re paying for coffee, splitting dinner bills, or shopping online, Google Pay makes every transaction smooth, safe, and simple.",
    "size": 85,
    "reviews": 220000000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 15000000 },
      { "name": "2 star", "count": 20000000 },
      { "name": "3 star", "count": 35000000 },
      { "name": "4 star", "count": 55000000 },
      { "name": "5 star", "count": 95000000 }
    ]
  }
]
